# Shared formulae for all machines.
# Install: `brew bundle` (from this repo root)
# On m4x also run: `brew bundle --file=local/m4x/Brewfile`

tap "anomalyco/tap"

# Core
brew "git"
brew "stow"                         # >= 2.4 (install.sh prereq)
brew "gh"
brew "curl"
brew "wget"

# Shell utilities
brew "bat"                          # cat replacement (zsh alias cat=bat)
brew "htop"                         # top replacement (zsh alias top=htop)
brew "tmux"
brew "jq"
brew "ripgrep"
brew "tree"
brew "nano"                         # macOS ships ancient pico-as-nano with no syntax highlighting

# Git
brew "difftastic"                   # difft — used by lazygit pager and git diff
brew "lazygit"

# GitHub Actions
brew "pinact"                       # pin actions to commit SHAs

# Languages and runtimes
brew "elixir"
brew "fnm"                          # Node version manager (pnpm via `corepack enable pnpm`)
brew "uv"                           # Python tooling

# AI / agents
brew "anomalyco/tap/opencode"
